Revit 2027 API
BuiltInFailures.BeamFailures Class
 Failures about Beams.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.BeamFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class BeamFailures
Public NotInheritable Class BeamFailures
public ref class BeamFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type BeamFailures = class end
The BuiltInFailures.BeamFailures type exposes the following members.
Properties
Name | Description
CannotBendBeamType |  Can't bend beam type "[Type Name]" along its location line. The beam is either too large or its curve is too sharp. You may be able to resolve the problem by reducing the beam's width in the bending direction, or by reducing acute angles in the curve.
Top
See Also
Reference
Autodesk.Revit.DB Namespace